{
  "Acetylation reaction": {
    "description": "An acetylation reaction involves the introduction of an acetyl group (CH3CO) into a molecule, typically replacing a hydrogen atom. This reaction is commonly used in organic synthesis to modify the chemical and physical properties of compounds, such as increasing stability or altering reactivity. Acetylation is a key step in the production of pharmaceuticals, dyes, and polymers.",
    "title": "Acetylation reaction"
  },
  "Acid formation": {
    "title": "Acid formation",
    "description": "Acid formation refers to reactions that produce acidic species. This can occur through the dissolution of non-metal oxides in water or through specific chemical syntheses."
  },
  "Acid-base reaction": {
    "description": "An acid-base reaction is a type of chemical reaction where an acid reacts with a base to form water and a salt. This reaction is an example of neutralization, where the hydrogen ions (<strong>H<sup>+</sup></strong>) from the acid combine with the hydroxide ions (<strong>OH<sup>-</sup></strong>) from the base to produce water. The resulting salt is a compound formed from the remaining ions of the acid and base. These reactions are common in various chemical processes, including digestion and the neutralization of harmful substances. The pH of the solution typically moves towards 7, indicating a neutral solution. Acid-base reactions are important in both industrial applications and biological systems.",
    "title": "Acid-base reaction"
  },
  "Addition reaction": {
    "description": "An addition reaction involves the combining of two or more molecules to form a single product without producing any byproducts. It typically occurs when reactants add across a multiple bond, such as a double or triple bond, resulting in a more saturated compound. This reaction mechanism is extensively utilized in organic synthesis to create a wide variety of functionalized compounds. Addition reactions are crucial for the production of polymers, pharmaceuticals, and specialty chemicals. Their controlled nature facilitates the design of complex molecules in both laboratory and industrial settings.",
    "title": "Addition reaction"
  },
  "Alkyl halide reaction": {
    "description": "An alkyl halide reaction involves the substitution of a halogen atom in an alkyl halide with another nucleophile. This reaction is fundamental in organic synthesis and is often used to introduce functional groups or modify the reactivity of alkyl halides. Alkyl halides are versatile intermediates that can undergo various substitution mechanisms, such as SN1 or SN2, depending on the nature of the nucleophile and leaving group. The resulting products are essential building blocks in the preparation of complex organic molecules.",
    "title": "Alkyl halide reaction"
  },
  "Amide formation": {
    "description": "Amide formation is a reaction that creates an amide bond by coupling a carboxylic acid or its derivative with an amine. This process is fundamental in the synthesis of peptides and pharmaceuticals, as well as in polymer chemistry. It generally requires activation of the acid component or the use of a catalyst to improve efficiency. The resulting amide linkage contributes to the stability and bioactivity of the molecule. Control over the reaction conditions is critical to minimize side reactions and achieve high yields.",
    "title": "Amide formation"
  },
  "Amination": {
    "description": "An amination reaction introduces an amino group into a molecule, thereby transforming its reactivity and properties. It often occurs as a key step in the synthesis of pharmaceuticals and agrochemicals. This reaction can proceed via nucleophilic substitution or electrophilic pathways, depending on the substrate. Amination reactions are instrumental in constructing complex nitrogen-containing structures and can be catalyzed by metals or enzymes. Their versatility makes them indispensable in organic synthesis.",
    "title": "Amination reaction"
  },
  "Aromatic conversion": {
    "title": "Aromatic conversion",
    "description": "Aromatic conversion refers to processes that transform non-aromatic compounds into aromatic ones (aromatization) or convert one aromatic compound into another."
  },
  "Aromatic nitration": {
    "title": "Aromatic nitration",
    "description": "Aromatic nitration is a specific type of electrophilic aromatic substitution where a nitro group (-NO2) is introduced onto an aromatic ring. This reaction is typically achieved using a mixture of nitric and sulfuric acids."
  },
  "Aromatic substitution": {
    "description": "Aromatic substitution is a type of chemical reaction where a substituent on an aromatic ring is replaced by another atom or group of atoms. This reaction preserves the aromaticity of the ring and is widely used in organic synthesis. Common types include electrophilic aromatic substitution, where an electrophile replaces a hydrogen atom, and nucleophilic aromatic substitution, where a nucleophile replaces a leaving group. Aromatic substitution reactions are fundamental in the production of dyes, pharmaceuticals, and agrochemicals.",
    "title": "Aromatic substitution"
  },
  "Aromatization": {
    "title": "Aromatization",
    "description": "Aromatization is a chemical reaction that converts a non-aromatic catalytic precursor into an aromatic compound. It is a key step in catalytic reforming and the synthesis of aromatic heterocycles."
  },
  "Byproduct formation": {
    "description": "Byproduct formation tracks generation of non-target species that impact purity, yield, or downstream operations. Early identification enables mitigation strategies (kinetic control, separation optimization, feed conditioning). In cyclic processes certain byproducts (e.g. CaCl₂) become valorization or disposal considerations. Quantitative tracking supports lifecycle and efficiency analyses.",
    "title": "Byproduct formation"
  },
  "CO2 source": {
    "title": "CO2 source",
    "description": "A CO2 source refers to a process or reaction that generates carbon dioxide. In industrial and laboratory contexts, this can be critical for carbon capture studies or as a reactant for carboxylation processes."
  },
  "Calcination": {
    "description": "Calcination is a high-temperature solid-state decomposition removing volatile components (e.g. CO₂, H₂O) to yield reactive oxides or carbonates. Heat transfer, residence time, and particle size distribution govern conversion efficiency and energy intensity. Off-gas recycling improves carbon utilization and process sustainability. Precise thermal profiling mitigates sintering that would reduce subsequent reactivity.",
    "title": "Calcination"
  },
  "Carbocation formation": {
    "description": "Carbocation formation involves the generation of a positively charged carbon center through heterolytic bond cleavage. This intermediate is central to many organic reactions, where it acts as an electrophile. The formation of carbocations is often a rate-determining step and can dictate the overall reaction pathway. Their stability depends on factors such as substituent effects, resonance, and hyperconjugation. Carbocation intermediates are key players in rearrangement, substitution, and addition reactions in organic synthesis.",
    "title": "Carbocation formation"
  },
  "Carbon capture": {
    "title": "Carbon capture",
    "description": "Carbon capture involves trapping carbon dioxide emissions from sources like power plants and industrial processes to prevent them from entering the atmosphere."
  },
  "Carbonylation": {
    "description": "Carbonylation incorporates carbon monoxide into an organic fragment to generate carbonyl-containing intermediates (e.g. acyl, carboxylate, carbonate) or end products. Rate and selectivity depend on CO pressure (or concentration), ligand electronics, catalyst nuclearity, and coordination dynamics. Carbonylation underpins large‑scale manufacture of acids, anhydrides, aldehydes, and fine chemicals, and is a central productivity lever in many homogeneous and heterogeneous catalytic cycles.",
    "title": "Carbonylation"
  },
  "Carboxylation reaction": {
    "title": "Carboxylation reaction",
    "description": "A carboxylation reaction introduces a carboxylic acid group into a molecule. It often involves the reaction of a nucleophile with carbon dioxide."
  },
  "Catalyst Activation": {
    "description": "Catalyst activation encompasses the transformations that convert a precatalyst or resting state into a catalytically competent species. Examples include ligand dissociation, reduction or oxidation, and initial oxidative addition events. Efficient activation minimizes induction periods, stabilizes productive states, and suppresses formation of off‑cycle or deactivated complexes, directly influencing process start‑up reliability.",
    "title": "Catalyst Activation"
  },
  "Catalyst Regeneration": {
    "description": "Catalyst regeneration restores the active form after product‑forming steps, enabling repeated turnover cycles. It may involve reductive or oxidative state changes, ligand exchange, or removal of inhibiting byproducts. Efficient regeneration extends catalyst lifetime, reduces precious metal usage, and stabilizes performance metrics during extended operation.",
    "title": "Catalyst Regeneration"
  },
  "Catalytic cycle": {
    "description": "The catalytic cycle describes a series of reaction steps in which a catalyst participates and is regenerated at the end of the process. This cycle facilitates the conversion of reactants to products while minimizing the overall activation energy required. It highlights the efficiency and sustainability of catalyzed reactions by showing how the catalyst is reused. Catalytic cycles are fundamental in both industrial chemistry and biological systems, ensuring reaction continuity and high turnover numbers. The concept aids in understanding and optimizing reaction mechanisms involving catalysts.",
    "title": "Catalytic cycle"
  },
  "Catalytic reaction": {
    "description": "A catalytic reaction is one that is accelerated by the presence of a catalyst, a substance that remains unchanged throughout the process. The catalyst provides an alternative reaction pathway with a lower activation energy, resulting in a faster reaction rate. This type of reaction is essential in many industrial syntheses and environmental applications, as it enables efficient chemical transformations under milder conditions. It is a cornerstone in modern chemistry, contributing to more sustainable and economical production methods.",
    "title": "Catalytic reaction"
  },
  "Catalytic reforming": {
    "title": "Catalytic reforming",
    "description": "Catalytic reforming is a chemical process used to convert petroleum refinery naphthas distilled from crude oil into high-octane liquid products called reformates, which are premium blending stocks for high-octane gasoline."
  },
  "Chain growth reaction": {
    "description": "A chain growth reaction is a polymerization mechanism where the active center of the polymer chain continuously adds monomer units. This process allows the molecular weight of the polymer to increase rapidly until termination occurs. It is typically initiated by a reactive species that propagates the chain reaction. Chain growth reactions are fundamental in producing a wide range of synthetic polymers used in everyday materials and high-performance applications. Their control is essential for achieving desired polymer properties.",
    "title": "Chain growth reaction"
  },
  "Chlorosulfonation": {
    "title": "Chlorosulfonation",
    "description": "Chlorosulfonation is the introduction of a sulfonyl chloride group (-SO2Cl) into a molecule, typically an aromatic ring, using chlorosulfonic acid. It is important in the synthesis of detergents and drugs."
  },
  "Color": {
    "title": "Color",
    "description": "Color in chemical reactions can indicate the presence of specific ions, the progress of a reaction, or the formation of products. It is a key observational property in qualitative analysis and pyrotechnics."
  },
  "Combination reaction": {
    "description": "A combination reaction, also known as a synthesis reaction, is a type of chemical reaction where two or more reactants merge to form a single, more complex product. This reaction often results in a compound with distinct properties that differ from those of the individual reactants. Combination reactions are essential in the synthesis of new compounds and play a significant role in various industrial and laboratory processes. They typically occur under moderate conditions and are often highly exothermic. This reaction is widely used in organic synthesis as well as in the industrial production of complex compounds.",
    "title": "Combination reaction"
  },
  "Combustion reaction": {
    "description": "A combustion reaction is a rapid oxidation process that releases a large amount of energy in the form of heat and light. It typically involves a fuel reacting with oxygen to produce carbon dioxide and water. This highly exothermic reaction is fundamental for energy production in engines and power plants. It is also studied extensively to improve efficiency and reduce pollutant emissions in industrial applications.",
    "title": "Combustion reaction"
  },
  "Condensation reaction": {
    "description": "A condensation reaction involves the joining of two molecules with the concomitant elimination of a small molecule such as water or methanol. This reaction mechanism is common in the formation of esters, amides, and peptides. It is characterized by the combination of functional groups that results in a more complex structure. Condensation reactions play a pivotal role in both organic synthesis and biological processes, such as protein formation. Their reversible nature also makes them useful in dynamic covalent chemistry.",
    "title": "Condensation reaction"
  },
  "Cyclization": {
    "description": "Cyclization is a reaction that leads to the formation of a ring structure through the intramolecular bonding of atoms in a molecule. This process is crucial in the formation of cyclic compounds, which are prevalent in natural products, pharmaceuticals, and polymers. Cyclization reactions can occur via various mechanisms, such as nucleophilic substitution or addition, often requiring specific catalysts or reaction conditions. They contribute to the rigidity and specific chemical behavior of cyclic molecules compared to their acyclic counterparts. The ability to efficiently form rings is a cornerstone of synthetic strategies in organic chemistry.",
    "title": "Cyclization"
  },
  "Decomposition": {
    "description": "A decomposition reaction occurs when a single compound breaks down into two or more simpler substances. This type of reaction typically requires energy input in the form of heat, light, or electricity and is fundamental in understanding the breakdown and recycling of chemical compounds. Decomposition reactions are widely used in both industrial applications and environmental processes to transform complex substances into more basic forms. They often serve as preliminary steps in chemical synthesis. This process plays a pivotal role in breaking down unstable compounds and recycling elements in natural systems.",
    "title": "Decomposition"
  },
  "Dehydrogenation": {
    "title": "Dehydrogenation",
    "description": "Dehydrogenation involves the removal of hydrogen from a molecule. It is widely used to produce alkenes and aromatics from alkanes and naphthenes, respectively."
  },
  "Deprotection": {
    "title": "Deprotection",
    "description": "Deprotection is a chemical step where a protecting group is removed to reveal a functional group for further reaction. It is a critical strategy in multi-step organic synthesis."
  },
  "Disproportionation reaction": {
    "description": "A disproportionation reaction occurs when a single chemical species undergoes simultaneous oxidation and reduction. In this process, part of the molecule is oxidized while another part is reduced, forming two distinct products with different oxidation states. This reaction is significant in redox chemistry and helps illustrate the dual behavior of certain compounds. It is often observed in both inorganic and organic systems, playing a key role in various metabolic and industrial processes.",
    "title": "Disproportionation reaction"
  },
  "Dissolution": {
    "title": "Dissolution",
    "description": "Dissolution is the process where a solute in a gaseous, liquid, or solid phase dissolves in a solvent to form a solution."
  },
  "Double displacement": {
    "description": "A double displacement reaction, also known as a double replacement or metathesis reaction, occurs when two compounds react to form two new compounds by exchanging their ions or components. The general formula for this type of reaction is <strong>AB + CD → AC + BD</strong>. In this process, the cations and anions of the two reactants switch places. Double displacement reactions often result in the formation of a precipitate, a gas, or a weak electrolyte like water. These reactions are common in inorganic chemistry, particularly in precipitation and acid-base reactions. They are important in various processes such as water treatment, where ions are exchanged to remove impurities.",
    "title": "Double displacement reaction"
  },
  "Electrophilic addition": {
    "description": "Electrophilic addition is a specific type of addition reaction where an electrophile targets a region of high electron density, typically a carbon-carbon double bond. The reaction begins when the electrophile forms a bond with one of the carbons, creating a reactive intermediate. This intermediate is then attacked by a nucleophile to complete the addition process. Electrophilic addition is widely employed in organic synthesis for modifying alkenes and alkynes. Its versatility makes it a fundamental reaction for constructing a broad range of industrial chemicals and pharmaceuticals.",
    "title": "Electrophilic addition"
  },
  "Electrophilic aromatic substitution": {
    "description": "Electrophilic aromatic substitution is a type of chemical reaction where an electrophile replaces a hydrogen atom on an aromatic ring. This reaction is a key process in organic synthesis, enabling the functionalization of aromatic compounds. Common examples include nitration, halogenation, and sulfonation of benzene derivatives. Electrophilic aromatic substitution is widely used in the production of dyes, pharmaceuticals, and polymers.",
    "title": "Electrophilic aromatic substitution"
  },
  "Electrophilic substitution": {
    "description": "Electrophilic substitution is a type of chemical reaction where an electrophile replaces a hydrogen atom or another substituent in an aromatic compound. This reaction preserves the aromaticity of the compound and is widely used in the synthesis of dyes, pharmaceuticals, and agrochemicals. Common examples include nitration, halogenation, and sulfonation of benzene derivatives.",
    "title": "Electrophilic substitution"
  },
  "Endothermic": {
    "title": "Endothermic",
    "description": "An endothermic process is any process which requires or absorbs energy from its surroundings, usually in the form of heat."
  },
  "Equilibrium": {
    "description": "An equilibrium reaction is characterized by the balance between the forward and reverse reactions, reaching a state where the rates of both processes are equal. At equilibrium, the concentrations of reactants and products remain constant over time, providing insights into the dynamic nature of chemical systems. Equilibrium reactions are critical in industrial processes and natural phenomena, including those found in biological systems. Adjusting temperature or pressure can shift the equilibrium position. Understanding the equilibrium constant is crucial for optimizing these reactions in practical applications.",
    "title": "Equilibrium"
  },
  "Esterification reaction": {
    "description": "An esterification reaction is a chemical process in which an alcohol reacts with a carboxylic acid to form an ester and water. This reaction is typically catalyzed by an acid, such as sulfuric acid, and is widely used in the production of fragrances, flavors, and polymers. Esterification is a reversible reaction, and the yield can be improved by removing water or using an excess of one reactant.",
    "title": "Esterification reaction"
  },
  "Ether formation": {
    "description": "Ether formation refers to the creation of an ether bond, where an oxygen atom links two alkyl or aryl groups together. This process typically occurs via nucleophilic substitution, where an oxygen nucleophile attacks a carbocation or another electrophilic center. The resulting ethers are important in both industrial processes and the synthesis of pharmaceuticals. Ether formation reactions often require careful control of reaction conditions to minimize side reactions. They are a central methodology in organic chemistry for constructing molecules with diverse physical and chemical properties.",
    "title": "Ether formation"
  },
  "Fireworks": {
    "title": "Fireworks",
    "description": "Fireworks reactions involve rapid combustion and emission of light and color, often relying on metal salts to produce specific colors and oxidizers to sustain the reaction."
  },
  "Gas absorption": {
    "title": "Gas absorption",
    "description": "Gas absorption is a mass transfer operation where a soluble vapor is absorbed from a gas mixture into a liquid absorbent. This is widely used for gas purification and recovery of valuable products."
  },
  "Golden rain": {
    "title": "Golden rain",
    "description": "The 'Golden Rain' experiment is a classic precipitation reaction involving lead(II) iodide, which forms glittering yellow crystals resembling gold dust when cooling from a hot solution."
  },
  "Hydrodealkylation": {
    "title": "Hydrodealkylation",
    "description": "Hydrodealkylation is a chemical reaction that involves the removal of alkyl groups from aromatic rings in the presence of hydrogen, often producing simpler aromatic hydrocarbons like benzene."
  },
  "Hydrogen abstraction": {
    "description": "Hydrogen abstraction is a bimolecular radical process in which a radical removes an H atom (H·) from a donor substrate, forming a new σ bond and a new radical center. This step translocates radical character onto a different molecular framework, lowering barriers for subsequent functionalization (e.g. O incorporation) and shaping chain propagation kinetics. Selectivity reflects C–H bond dissociation energies, steric accessibility, and polar (electron‑withdrawing / donating) effects.",
    "title": "Hydrogen abstraction"
  },
  "Hydrolysis": {
    "description": "(Alias of <em>Hydrolysis reaction</em>) Bond cleavage by water that distributes H<sup>+</sup> and OH<sup>-</sup> across the fragments. See the Hydrolysis reaction entry for the extended mechanistic, process, and sustainability context relevant to catalytic cycles.",
    "title": "Hydrolysis"
  },
  "Hydrolysis reaction": {
    "description": "A hydrolysis reaction involves the cleavage of chemical bonds by the addition of water. This reaction is essential in both organic and inorganic chemistry, as it contributes to the breakdown of complex molecules into simpler components. Hydrolysis plays a significant role in biological digestion and environmental degradation. The reaction conditions such as pH and temperature greatly influence the reaction rate and product distribution. Its reversibility is often exploited in industrial processes to modify material properties.",
    "title": "Hydrolysis reaction"
  },
  "In Situ Generation": {
    "description": "In situ generation produces a reactive species directly within the reaction medium rather than via external dosing. Continuous formation of methyl iodide in Cativa minimizes handling losses and decomposition, maintains steady-state levels, and improves process safety. It exemplifies process intensification strategies in modern catalytic manufacturing.",
    "title": "In Situ Generation"
  },
  "Isomerization": {
    "title": "Isomerization",
    "description": "Isomerization is the process by which a molecule is transformed into an isomer with a different chemical structure. This is crucial in the petrochemical industry for converting straight-chain hydrocarbons into branched ones for higher octane ratings."
  },
  "Loop closure": {
    "description": "Loop closure denotes completing a reagent or catalyst cycle so net consumable demand approaches zero. It integrates regeneration, separation, and recycle to stabilize inventories and compositions. Robust closure enhances sustainability metrics and reduces supply chain sensitivity. Monitoring ensures drift or impurity buildup is mitigated.",
    "title": "Loop closure"
  },
  "Meta directing group": {
    "title": "Meta directing group",
    "description": "In electrophilic aromatic substitution, a meta directing group is a substituent on the aromatic ring that directs incoming electrophiles to the meta position. These groups are typically electron-withdrawing."
  },
  "Methylation": {
    "description": "Methylation introduces a methyl group (–CH<sub>3</sub>) into a molecule, modulating polarity, reactivity, or binding properties. In the Cativa process, methanol and hydrogen iodide generate methyl iodide in situ, supplying the active methylating agent for oxidative addition to iridium. Steady methyl iodide formation stabilizes carbonylation throughput, while selectivity and catalyst turnover frequency depend on controlling this precursor supply step.",
    "title": "Methylation"
  },
  "Migratory Insertion": {
    "description": "Migratory insertion is a rearrangement in which a ligated fragment (commonly alkyl or hydride) shifts onto an adjacent coordinated unsaturated ligand (e.g. CO, alkene, alkyne), forming a new σ bond and elongating or transforming the ligand framework. Frequently a rate‑ or selectivity‑determining event, its kinetics are governed by electronic tuning, steric architecture, and ligand lability around the metal center. It enables chain growth, acyl formation, and stereocontrolled carbon–carbon linkage.",
    "title": "Migratory Insertion"
  },
  "Multicomponent reaction": {
    "description": "A multicomponent reaction involves three or more reactants in a single synthetic operation to form a product that incorporates substantial portions of all the inputs. This strategy is highly efficient as it enables rapid synthesis of complex molecules while minimizing purification steps. It has found significant applications in drug discovery, combinatorial chemistry, and material science. These reactions often display high atom economy and generate diverse libraries of compounds. Their design requires careful optimization of reaction conditions to balance reactivity and selectivity.",
    "title": "Multicomponent reaction"
  },
  "Net ionic": {
    "title": "Net ionic",
    "description": "A net ionic equation shows only the chemical species that are involved in a reaction, omitting the spectator ions that remain unchanged."
  },
  "Neutralization reaction": {
    "description": "A neutralization reaction is a specific type of acid-base reaction where an acid and a base react to form water and a salt. This process effectively reduces the reactivity of the participating species by forming more stable products. Neutralization reactions are vital in chemical manufacturing, waste treatment, and maintaining balanced pH levels in natural and industrial systems. They are frequently accompanied by a significant release of heat, making them useful in controlling reaction conditions. The exothermic nature of these reactions also highlights the energetic feasibility of the neutralization process.",
    "title": "Neutralization reaction"
  },
  "Nitrile addition": {
    "description": "Nitrile addition refers to a reaction where a nitrile group is added across a multiple bond or inserted into a substrate, enhancing the nitrogen content of the molecule. This reaction is commonly observed in the formation of complex nitrogenous compounds and serves as a key step in many prebiotic syntheses. It can proceed through various mechanisms, often involving nucleophilic attack on an electrophilic center. The resulting products are useful intermediates in the synthesis of heterocyclic compounds. Such reactions underscore the emerging importance of nitrile chemistry in both laboratory and industrial settings.",
    "title": "Nitrile addition"
  },
  "Nucleophilic addition": {
    "description": "Nucleophilic addition is a reaction mechanism in which a nucleophile forms a bond with an electron-deficient substrate, typically an unsaturated carbonyl compound. This process results in the direct formation of new carbon-heteroatom bonds and is fundamental to many organic transformations. It plays a crucial role in synthesizing alcohols, amines, and other functional groups by adding across double bonds. The reaction pathway is often sensitive to steric and electronic factors, dictating its regio- and stereoselectivity. Its broad applicability makes nucleophilic addition a cornerstone of synthetic organic chemistry.",
    "title": "Nucleophilic addition"
  },
  "Nucleophilic attack": {
    "description": "Nucleophilic attack is a chemical reaction mechanism where a nucleophile, a species with a lone pair of electrons, forms a bond with an electrophilic center in a molecule. This process results in the displacement of a leaving group and the formation of a new covalent bond. Nucleophilic attacks are common in organic chemistry and are essential in the synthesis of various functional groups, such as alcohols, amines, and ethers. The regio- and stereochemistry of the reaction are influenced by factors such as steric hindrance and electronic effects.",
    "title": "Nucleophilic attack"
  },
  "Nucleophilic substitution": {
    "description": "Nucleophilic substitution is a specific type of substitution reaction where a nucleophile, a species with a lone pair of electrons, attacks an electrophilic center in a molecule, replacing a leaving group. This reaction is fundamental in organic synthesis, particularly in the formation of alcohols, ethers, and amines. It can proceed via two main mechanisms: SN1 (unimolecular) and SN2 (bimolecular), depending on the reaction conditions and substrate structure.",
    "title": "Nucleophilic substitution"
  },
  "Organometallic Chemistry": {
    "description": "Organometallic chemistry concerns compounds featuring direct metal–carbon bonds that enable activation of otherwise inert substrates (e.g. CO, C–H, C–X). Interplay of oxidation state changes, ligand electronics, and coordination geometry underpins key elementary steps such as oxidative addition, migratory insertion, β-hydride elimination, and reductive elimination. Mastery of these principles drives advances in selective, energy‑efficient catalysis across fine chemical, polymer, and bulk commodity synthesis.",
    "title": "Organometallic Chemistry"
  },
  "Oxidation reaction": {
    "description": "An oxidation reaction is characterized by the loss of electrons from a chemical species, often occurring with the involvement of oxygen or other oxidizing agents. This process is central to phenomena such as corrosion, cellular respiration, and energy production. It is usually coupled with a corresponding reduction reaction to maintain the electron balance. Understanding oxidation reactions is crucial for controlling material degradation and optimizing industrial processes.",
    "title": "Oxidation reaction"
  },
  "Oxidative Addition": {
    "description": "Oxidative addition is an elementary organometallic step in which a low-valent metal inserts into a σ bond, increasing both its oxidation state and coordination number. This transformation typically generates two new metal–ligand bonds (e.g. M–R and M–X from R–X) and establishes a platform for subsequent steps such as migratory insertion or reductive elimination. Kinetic and thermodynamic control over this often reversible step shapes catalyst speciation, turnover frequency, and selectivity in many cross-coupling and carbonylation processes.",
    "title": "Oxidative Addition"
  },
  "Photochemical reaction": {
    "description": "Photochemical reactions are driven by the absorption of light, which promotes chemical species to excited states and alters their reactivity. These reactions are pivotal in processes ranging from atmospheric chemistry to the synthesis of complex organic molecules. The input of light energy allows for unique reaction pathways that are not accessible under thermal conditions. Photochemical transformations often lead to rearrangements, cyclizations, or isomerizations that contribute to molecular diversity. Their application in synthetic chemistry continues to grow with advances in light sources and catalyst design.",
    "title": "Photochemical reaction"
  },
  "Photolysis": {
    "description": "Photolysis is bond cleavage driven by absorption of photons whose energy exceeds the dissociation threshold of a chromophore. In atmospheric and prebiotic contexts it furnishes highly reactive radical fragments (e.g. H·, OH·) without requiring thermal extremes or molecular oxidants. Selectivity depends on wavelength distribution, absorption cross‑section, and competing relaxation pathways. The released radicals seed initiation steps that launch downstream radical chains and redox reshuffling.",
    "title": "Photolysis"
  },
  "Polymerization reaction": {
    "description": "A polymerization reaction is a process that converts monomer molecules into polymers through repeated chemical bonding. This reaction can occur via chain growth or step-growth mechanisms, resulting in materials with tailored physical and chemical properties. Polymerization is central to the production of plastics, rubbers, and fibers used in a myriad of applications. Control of the reaction conditions allows for precise manipulation of molecular weight and architecture. These reactions not only contribute to material science but also to innovative biomedical applications.",
    "title": "Polymerization reaction"
  },
  "Precipitation": {
    "description": "A precipitation reaction occurs when two aqueous solutions containing soluble salts are mixed and one of the reaction products is insoluble in water, forming a solid known as a precipitate. This reaction is utilized extensively in analytical chemistry for ion detection and removal, as well as in wastewater treatment processes. The formation of the precipitate results from the combination of ions that form an insoluble compound, and the reaction is influenced by factors such as concentration, temperature, and the solubility product constant (Ksp). Precipitation reactions are fundamental in chemical synthesis and environmental chemistry.",
    "title": "Precipitation reaction"
  },
  "Precursor Formation": {
    "description": "Precursor formation labels a step that deliberately generates a reactive intermediate required downstream. In Cativa, in situ production of methyl iodide ensures a continuous methyl source for oxidative addition and carbonylation. Effective control moderates concentration swings, reduces side reactions, and enhances overall productivity and catalyst stability.",
    "title": "Precursor Formation"
  },
  "Process Efficiency": {
    "description": "Process efficiency aggregates factors such as yield, turnover frequency, atom economy, energy consumption, and waste generation. Highlighting leverage points allows optimization to focus where marginal gains provide the largest operational and sustainability benefits. Improved efficiency lowers cost, resource intensity, and environmental footprint.",
    "title": "Process Efficiency"
  },
  "Product formation": {
    "description": "Product formation marks the stage where the target molecule or a key isolable intermediate emerges at practical yield. Performance here reflects cumulative upstream control of precursor supply, catalytic cycle efficiency, and reaction environment. Clear delineation of this stage streamlines analytical tracking and quality control.",
    "title": "Product Formation"
  },
  "Protonation": {
    "description": "Protonation is the process of adding a proton (H⁺) to a molecule, resulting in the formation of a positively charged species. This reaction often increases the reactivity of the molecule by altering its electron density. Protonation is common in acid-base chemistry and plays a pivotal role in many biochemical reactions. It can serve as an activation step for subsequent transformations, enabling molecules to undergo further chemical changes. The process is typically reversible, depending on the reaction conditions and the strength of the acid involved.",
    "title": "Protonation"
  },
  "Radical initiation": {
    "description": "Radical initiation denotes the elementary event(s) that first generate free radical species from closed‑shell precursors (e.g. photolysis, homolytic bond fission, redox single‑electron transfer). Efficient initiation establishes a baseline radical flux that drives subsequent propagation cycles. In dilute prebiotic gas mixtures it governs overall chain length, product distribution, and the balance between constructive synthesis and unproductive recombination.",
    "title": "Radical initiation"
  },
  "Radical propagation": {
    "description": "Radical propagation encompasses successive radical transformations that regenerate a radical (often of a different identity) while advancing molecular complexity. Propagation steps sustain chain length, amplify small initiation events, and channel reactive intermediates toward productive products instead of termination. Kinetic efficiency and selectivity depend on collision frequency, activation barriers, and competition from recombination or disproportionation pathways.",
    "title": "Radical propagation"
  },
  "Radical recombination": {
    "description": "Radical recombination (termination) couples two radicals to yield a closed‑shell product, removing reactive species from the medium and capping chain length. It can sequester functionality into stable molecules (e.g. methanol from CH<sub>3</sub>· and OH·) or form diatomics (H<sub>2</sub>) that alter redox and mass balance. The diffusion‑controlled nature of many recombination events makes radical concentration and medium phase critical levers for steering net reaction outcomes.",
    "title": "Radical recombination"
  },
  "Rate-Determining Step": {
    "description": "The rate‑determining step is the slowest elementary transformation in a multistep mechanism, imposing an upper limit on overall reaction velocity. Accurate identification (via kinetic profiling, isotope effects, or reaction progress analysis) ensures optimization efforts target the true kinetic bottleneck, enabling rational improvements in throughput, selectivity, and energy efficiency.",
    "title": "Rate-Determining Step"
  },
  "Reagent Recycling": {
    "description": "Reagent recycling recovers and reuses a non‑stoichiometric participant to reduce consumable demand, waste, and cost. Effective recycle loops stabilize stoichiometry, improve atom economy, and embody green process design principles across catalytic and stoichiometric transformations.",
    "title": "Reagent Recycling"
  },
  "Recycling": {
    "title": "Recycling",
    "description": "Recycling in a chemical process context involves recovering unreacted reagents, catalysts, or solvents and returning them to the process loop to minimize waste and improve efficiency."
  },
  "Redox reaction": {
    "description": "A redox reaction, short for reduction-oxidation reaction, is a type of chemical reaction that involves the transfer of electrons between two chemical species. One reactant undergoes oxidation, where it loses electrons, while the other undergoes reduction, where it gains electrons. The species that loses electrons is called the reducing agent, while the species that gains electrons is called the oxidizing agent. Redox reactions are essential in various biological processes, such as cellular respiration, as well as in industrial applications like batteries and corrosion prevention",
    "title": "Redox reaction"
  },
  "Reduction reaction": {
    "description": "A reduction reaction involves the gain of electrons by a chemical species, resulting in a decrease in its oxidation state. This process is often accompanied by the transfer of protons or the removal of oxygen atoms. Reduction reactions are essential in biological systems, such as photosynthesis and cellular respiration, as well as in industrial processes like metal extraction and wastewater treatment. They are frequently paired with oxidation reactions to form redox reactions.",
    "title": "Reduction reaction"
  },
  "Reductive Elimination": {
    "description": "Reductive elimination couples two ligands on a metal center to form a new σ bond while decreasing the metal's oxidation state and coordination number. It is pivotal for product‑releasing steps in cross‑coupling, hydrofunctionalization, carbonylation, and polymerization catalysis. High fidelity and favorable kinetics prevent accumulation of higher‑valent off‑cycle species and sustain catalytic turnover.",
    "title": "Reductive Elimination"
  },
  "Regeneration": {
    "description": "Regeneration restores a cyclic reagent or catalyst to its active form after consumption in intermediate steps. Effective regeneration loops reduce raw material throughput and waste formation. In ammonia-based cycles this step liberates NH₃ while fixing byproduct salts. Its efficiency strongly influences overall process economics and emissions.",
    "title": "Regeneration"
  },
  "SN2 reaction": {
    "title": "SN2 reaction",
    "description": "The SN2 reaction is a type of nucleophilic substitution where a lone pair from a nucleophile attacks an electron deficient electrophilic center and bonds to it, expelling a leaving group. It proceeds in a single concerted step."
  },
  "Selective crystallization": {
    "title": "Selective crystallization",
    "description": "Selective crystallization is a purification technique where a specific component of a mixture is induced to crystallize out of solution, typically by controlling temperature or solvent composition."
  },
  "Separation": {
    "title": "Separation",
    "description": "Separation processes are used to isolate specific compounds from a mixture. Techniques include distillation, filtration, and extraction, which are essential for purifying reaction products."
  },
  "Substitution reaction": {
    "description": "A substitution reaction is a type of chemical reaction where one atom or group of atoms in a molecule is replaced by another atom or group of atoms. This reaction is common in organic and inorganic chemistry and can occur via different mechanisms, such as nucleophilic, electrophilic, or radical substitution. Substitution reactions are widely used in the synthesis of pharmaceuticals, agrochemicals, and polymers, enabling the functionalization of molecules to achieve desired properties or reactivity.",
    "title": "Substitution reaction"
  },
  "Sulfonamide formation": {
    "title": "Sulfonamide formation",
    "description": "Sulfonamide formation involves the reaction of a sulfonyl chloride with an amine to form a sulfonamide. This linkage is the basis of sulfa drugs."
  },
  "Thermal decomposition": {
    "title": "Thermal decomposition",
    "description": "Thermal decomposition is a chemical decomposition caused by heat. The reaction is usually endothermic as heat is required to break chemical bonds in the compound undergoing decomposition."
  }
}